app/controllers/addresses_controller.rb

SELECT * FROM "addresses"
---
  def index
    @addresses = Address.all

SELECT * FROM "addresses" WHERE ("addresses"."id" = 1)
---
  def show
    @address = Address.find(params[:id])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 4)
---
  def edit
    @address = Address.find(params[:id])

INSERT INTO "addresses" ("data_spr", "created_at", "data_mod", "opis", "updated_at", "blokada", "id", "komunikaty", "adres", "klucz") VALUES ('2010-05-01 15:20:00', NULL, '2010-05-01 15:20:00', '', NULL, 'f', NULL, '', 'http://google.pl', '715e91ed9dbb69be8f9da55d9f1683ef')
---
  def create
  	if (params[:address][:adres] =~ /^http:\/\//) == nil
  		params[:address][:adres] = "http://" + params[:address][:adres]
  	end
  	params[:address][:klucz] = Digest::MD5.hexdigest(params[:address][:adres])
  	params[:address][:data_spr] = Time.new
  	params[:address][:data_mod] = Time.new
  	params[:address][:blokada] = false
    @address = Address.new(params[:address])
		respond_to do |format|
			if @address.save

SELECT * FROM "addresses" WHERE ("addresses"."id" = 4)
UPDATE "addresses" SET "updated_at" = '2010-02-13 00:26:55', "created_at" = '2010-02-13 00:26:55', "data_spr" = '2010-02-28 16:04:00', "blokada" = 't', "opis" = '', "id" = 5, "adres" = 'http://littled.vroc.pl/wip/', "komunikaty" = '1 3 5 7 8', "data_mod" = '2010-02-25 17:21:00' WHERE ("klucz" = 'ab27cdf35b43599b8f1f953ee6608f74')
---
  def update
    @address = Address.find(params[:id])

    respond_to do |format|
      if @address.update_attributes(params[:address])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 2)
DELETE FROM "addresses" WHERE "id" = 2
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy