app/controllers/messages_controller.rb

	def index
		@messages = Message.all
---
SELECT * FROM "messages"

	def show
		@message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

	def edit
		@message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 5)

	def create
		@message = Message.new(params[:message])

		respond_to do |format|
			if @message.save
---
INSERT INTO "messages" ("data", "created_at", "tresc", "updated_at") VALUES('2010-02-27 23:52:00', '2010-02-27 23:52:28', 'Ala ma kota', '2010-02-27 23:52:28')

	def update
		@message = Message.find(params[:id])

		respond_to do |format|
			if @message.update_attributes(params[:message])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 5)
UPDATE "messages" SET "updated_at" = '2010-02-27 23:54:26', "tresc" = 'Kot Piotrka nie ma pcheł, ale głośno miałczy i obryza mi żepa od zasilacza od ThinkPada, dlatego go nie lubię!!!' WHERE "id" = 5

	def destroy
		@message = Message.find(params[:id])
		@message.destroy
---
SELECT * FROM "messages" WHERE ("messages"."id" = 2)
DELETE FROM "messages" WHERE "id" = 2