app/controllers/rss_controller.rb

	def of
		headers['Content-type'] = 'text/xml'
		sprawdz_zawartosc_rss(User.find_by_klucz(params[:id]))
---
SELECT * FROM "users" WHERE (("users"."klucz"='littled'))