app/controllers/users_controller.rb

SELECT * FROM "users" WHERE (("users"."klucz"='kot'))
---
  def edit
    @user = User.find(params[:id])
		if @user[:obserwowane] != ""
			@obserwowane = Address.find(:all, :conditions => ["klucz IN (?)", @user[:obserwowane].split(/ /)])