app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "addresses" WHERE (klucz NOT IN ('ab27cdf35b43599b8f1f953ee6608f74','12c5ebe285fcba74c012b85021d526a2'))
---
	def edit
		@address = Address.new

		if admin_logged_in? and params[:id].nil? == false
			@user = User.find(params[:id])
		else
			@user = current_user
		end
		@addresses = Address.all

INSERT INTO "users" ("created_at", "updated_at", "kot", "obserwowane") VALUES('2010-02-17 22:09:18', '2010-02-17 22:09:18', NULL, 'ueaoeu')
---
	def create

		genotyp = nil
		genotyp = Genotype.find(:first, :conditions => { :genotyp => params[:genotyp] }) if params[:genotyp] != nil

		autoryzowane = false
		autoryzowane = true if admin_logged_in?
		autoryzowane = true if !admin_logged_in? && !genotyp.nil?

		widok = 'new'
		widok = 'user_new' if !(admin_logged_in?)

		przekierowanie = users_path
		przekierowanie = root_path if !(admin_logged_in?)

		if !admin_logged_in? && !genotyp
			flash[:error] = "Nieprawidłowa fraza"
		else
			flash[:error] = nil
		end

		params[:user].delete(:address_opises)

		@user = User.new(params[:user])
		@addresses = Address.all

		respond_to do |format|
			if autoryzowane && @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = NULL, "created_at" = NULL, "id" = 3, "haslo" = NULL, "obserwowane" = 'ab27cdf35b43599b8f1f953ee6608f74 12c5ebe285fcba74c012b85021d526a2' WHERE ("klucz" = 'littled')
---
	def update
		@user = User.find(params[:id])
#		@filtry = params[:filters]
#		if @filtry != nil
#			params[:user][:obserwowane] = @filtry.join(" ")
#		else
#			params[:user][:obserwowane] = nil
#		end
		#przekierowanie = users_path
		przekierowanie = users_path
		przekierowanie = root_path if !(admin_logged_in?)

		zmiana_subskrypcji = false
		if !params[:user][:zmiana_subskrypcji].nil?
			zmiana_subskrypcji = true
			params[:user].delete(:zmiana_subskrypcji)
		end

		if zmiana_subskrypcji
			params[:user][:address_ids] = [] if out = params[:user][:address_ids].nil?
			params[:user][:address_opises] = [] if out = params[:user][:address_opises].nil?

			identyfikatory = params[:user][:address_ids]
			opisy = params[:user][:address_opises]

			params[:user].delete(:address_opises)
		end

		respond_to do |format|
			if @user.update_attributes(params[:user])